results/wrk2/oraclejdk8/jsonget.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R100000 -L -v http://localhost:9000/json
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/json
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.351ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.348ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.372ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.354ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.45ms    1.48ms  27.02ms   92.40%
    Req/Sec    26.39k     3.13k   43.56k    78.92%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.09ms
 75.000%    1.70ms
 90.000%    2.60ms
 99.000%    8.19ms
 99.900%   14.79ms
 99.990%   20.96ms
 99.999%   24.33ms
100.000%   27.04ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.041     0.000000            1         1.00
       0.401     0.100000       499731         1.11
       0.581     0.200000       998843         1.25
       0.751     0.300000      1499740         1.43
       0.920     0.400000      2000041         1.67
       1.094     0.500000      2497665         2.00
       1.187     0.550000      2747077         2.22
       1.289     0.600000      2997475         2.50
       1.404     0.650000      3247560         2.86
       1.537     0.700000      3496091         3.33
       1.697     0.750000      3745595         4.00
       1.791     0.775000      3870558         4.44
       1.898     0.800000      3995362         5.00
       2.022     0.825000      4121035         5.71
       2.169     0.850000      4245657         6.67
       2.353     0.875000      4370712         8.00
       2.465     0.887500      4433036         8.89
       2.595     0.900000      4495039        10.00
       2.753     0.912500      4557170        11.43
       2.957     0.925000      4619835        13.33
       3.241     0.937500      4681972        16.00
       3.439     0.943750      4713305        17.78
       3.695     0.950000      4744432        20.00
       4.035     0.956250      4775652        22.86
       4.471     0.962500      4806794        26.67
       5.007     0.968750      4838182        32.00
       5.311     0.971875      4853623        35.56
       5.655     0.975000      4869262        40.00
       6.035     0.978125      4884867        45.71
       6.475     0.981250      4900498        53.33
       6.983     0.984375      4916052        64.00
       7.271     0.985938      4923880        71.11
       7.587     0.987500      4931661        80.00
       7.947     0.989062      4939490        91.43
       8.359     0.990625      4947237       106.67
       8.855     0.992188      4955126       128.00
       9.135     0.992969      4959006       142.22
       9.447     0.993750      4962853       160.00
       9.807     0.994531      4966800       182.86
      10.215     0.995313      4970657       213.33
      10.695     0.996094      4974571       256.00
      10.983     0.996484      4976502       284.44
      11.303     0.996875      4978475       320.00
      11.679     0.997266      4980420       365.71
      12.087     0.997656      4982358       426.67
      12.607     0.998047      4984299       512.00
      12.967     0.998242      4985284       568.89
      13.351     0.998437      4986259       640.00
      13.807     0.998633      4987234       731.43
      14.343     0.998828      4988214       853.33
      14.855     0.999023      4989179      1024.00
      15.127     0.999121      4989679      1137.78
      15.415     0.999219      4990150      1280.00
      15.775     0.999316      4990641      1462.86
      16.199     0.999414      4991129      1706.67
      16.751     0.999512      4991616      2048.00
      17.151     0.999561      4991856      2275.56
      17.615     0.999609      4992100      2560.00
      18.079     0.999658      4992346      2925.71
      18.447     0.999707      4992591      3413.33
      18.831     0.999756      4992840      4096.00
      19.119     0.999780      4992955      4551.11
      19.423     0.999805      4993074      5120.00
      19.775     0.999829      4993203      5851.43
      20.127     0.999854      4993324      6826.67
      20.543     0.999878      4993440      8192.00
      20.815     0.999890      4993501      9102.22
      20.991     0.999902      4993562     10240.00
      21.247     0.999915      4993624     11702.86
      21.471     0.999927      4993686     13653.33
      21.711     0.999939      4993748     16384.00
      21.823     0.999945      4993777     18204.44
      22.015     0.999951      4993808     20480.00
      22.223     0.999957      4993839     23405.71
      22.511     0.999963      4993869     27306.67
      22.767     0.999969      4993897     32768.00
      22.863     0.999973      4993912     36408.89
      23.055     0.999976      4993930     40960.00
      23.183     0.999979      4993943     46811.43
      23.503     0.999982      4993958     54613.33
      23.743     0.999985      4993974     65536.00
      23.871     0.999986      4993981     72817.78
      24.015     0.999988      4993990     81920.00
      24.223     0.999989      4993996     93622.86
      24.447     0.999991      4994004    109226.67
      24.607     0.999992      4994012    131072.00
      24.815     0.999993      4994015    145635.56
      24.911     0.999994      4994019    163840.00
      25.039     0.999995      4994023    187245.71
      25.263     0.999995      4994027    218453.33
      25.391     0.999996      4994030    262144.00
      25.503     0.999997      4994032    291271.11
      25.567     0.999997      4994034    327680.00
      25.647     0.999997      4994036    374491.43
      25.743     0.999998      4994038    436906.67
      25.983     0.999998      4994040    524288.00
      26.079     0.999998      4994041    582542.22
      26.159     0.999998      4994042    655360.00
      26.287     0.999999      4994043    748982.86
      26.447     0.999999      4994044    873813.33
      26.591     0.999999      4994045   1048576.00
      26.591     0.999999      4994045   1165084.44
      26.623     0.999999      4994046   1310720.00
      26.623     0.999999      4994046   1497965.71
      26.783     0.999999      4994047   1747626.67
      26.783     1.000000      4994047   2097152.00
      26.783     1.000000      4994047   2330168.89
      26.927     1.000000      4994048   2621440.00
      26.927     1.000000      4994048   2995931.43
      26.927     1.000000      4994048   3495253.33
      26.927     1.000000      4994048   4194304.00
      26.927     1.000000      4994048   4660337.78
      27.039     1.000000      4994049   5242880.00
      27.039     1.000000      4994049          inf
#[Mean    =        1.453, StdDeviation   =        1.483]
#[Max     =       27.024, Total count    =      4994049]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  5997139 requests in 1.00m, 2.20GB read
Requests/sec:  99953.25
Transfer/sec:     37.46MB