results/wrk2/oraclejdk8/paintextpost.txt
andriy@notebook:~/Projects/com/github/plokhotnyuk/play$ ./wrk -c50 -d1m -t4 -R47000 -L -v -s src/test/lua/plaintextPost.lua http://localhost:9000/plaintext
wrk 4.0.0 [epoll] Copyright (C) 2012 Will Glozer
Running 1m test @ http://localhost:9000/plaintext
  4 threads and 50 connections
  Thread calibration: mean lat.: 1.383ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.358ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.379ms, rate sampling interval: 10ms
  Thread calibration: mean lat.: 1.387ms, rate sampling interval: 10ms
  Thread Stats   Avg      Stdev     Max   +/- Stdev
    Latency     1.42ms    1.12ms  27.70ms   93.05%
    Req/Sec    12.39k     1.23k   21.10k    78.30%
  Latency Distribution (HdrHistogram - Recorded Latency)
 50.000%    1.24ms
 75.000%    1.74ms
 90.000%    2.25ms
 99.000%    6.08ms
 99.900%   14.14ms
 99.990%   19.74ms
 99.999%   22.91ms
100.000%   27.71ms

  Detailed Percentile spectrum:
       Value   Percentile   TotalCount 1/(1-Percentile)

       0.110     0.000000            1         1.00
       0.566     0.100000       235583         1.11
       0.749     0.200000       470053         1.25
       0.914     0.300000       705573         1.43
       1.077     0.400000       939681         1.67
       1.243     0.500000      1174120         2.00
       1.329     0.550000      1291817         2.22
       1.418     0.600000      1408488         2.50
       1.514     0.650000      1526266         2.86
       1.619     0.700000      1643754         3.33
       1.736     0.750000      1760856         4.00
       1.801     0.775000      1819601         4.44
       1.872     0.800000      1878241         5.00
       1.949     0.825000      1936328         5.71
       2.036     0.850000      1995268         6.67
       2.135     0.875000      2054625         8.00
       2.189     0.887500      2083380         8.89
       2.251     0.900000      2113175        10.00
       2.319     0.912500      2142238        11.43
       2.399     0.925000      2171620        13.33
       2.495     0.937500      2200586        16.00
       2.553     0.943750      2215157        17.78
       2.621     0.950000      2229943        20.00
       2.701     0.956250      2244452        22.86
       2.805     0.962500      2259074        26.67
       2.949     0.968750      2273771        32.00
       3.053     0.971875      2281154        35.56
       3.189     0.975000      2288423        40.00
       3.401     0.978125      2295736        45.71
       3.787     0.981250      2303074        53.33
       4.451     0.984375      2310411        64.00
       4.839     0.985938      2314079        71.11
       5.275     0.987500      2317728        80.00
       5.755     0.989062      2321392        91.43
       6.303     0.990625      2325060       106.67
       6.919     0.992188      2328730       128.00
       7.267     0.992969      2330559       142.22
       7.679     0.993750      2332407       160.00
       8.163     0.994531      2334226       182.86
       8.767     0.995313      2336060       213.33
       9.479     0.996094      2337898       256.00
       9.887     0.996484      2338814       284.44
      10.335     0.996875      2339731       320.00
      10.839     0.997266      2340647       365.71
      11.423     0.997656      2341564       426.67
      12.087     0.998047      2342483       512.00
      12.431     0.998242      2342940       568.89
      12.823     0.998437      2343394       640.00
      13.263     0.998633      2343858       731.43
      13.671     0.998828      2344312       853.33
      14.191     0.999023      2344767      1024.00
      14.479     0.999121      2344999      1137.78
      14.799     0.999219      2345225      1280.00
      15.143     0.999316      2345459      1462.86
      15.543     0.999414      2345685      1706.67
      15.959     0.999512      2345912      2048.00
      16.239     0.999561      2346027      2275.56
      16.511     0.999609      2346151      2560.00
      16.815     0.999658      2346256      2925.71
      17.167     0.999707      2346372      3413.33
      17.695     0.999756      2346486      4096.00
      17.951     0.999780      2346545      4551.11
      18.191     0.999805      2346600      5120.00
      18.495     0.999829      2346658      5851.43
      18.943     0.999854      2346717      6826.67
      19.327     0.999878      2346776      8192.00
      19.551     0.999890      2346803      9102.22
      19.839     0.999902      2346833     10240.00
      20.143     0.999915      2346860     11702.86
      20.383     0.999927      2346887     13653.33
      20.767     0.999939      2346915     16384.00
      20.911     0.999945      2346930     18204.44
      21.119     0.999951      2346945     20480.00
      21.263     0.999957      2346959     23405.71
      21.487     0.999963      2346974     27306.67
      21.775     0.999969      2346987     32768.00
      21.919     0.999973      2346995     36408.89
      21.999     0.999976      2347002     40960.00
      22.143     0.999979      2347008     46811.43
      22.383     0.999982      2347016     54613.33
      22.479     0.999985      2347023     65536.00
      22.559     0.999986      2347026     72817.78
      22.735     0.999988      2347030     81920.00
      22.863     0.999989      2347033     93622.86
      23.055     0.999991      2347037    109226.67
      23.279     0.999992      2347041    131072.00
      23.359     0.999993      2347042    145635.56
      23.903     0.999994      2347044    163840.00
      24.687     0.999995      2347046    187245.71
      24.943     0.999995      2347048    218453.33
      25.087     0.999996      2347050    262144.00
      25.087     0.999997      2347050    291271.11
      25.215     0.999997      2347051    327680.00
      25.887     0.999997      2347052    374491.43
      26.559     0.999998      2347053    436906.67
      26.959     0.999998      2347054    524288.00
      26.959     0.999998      2347054    582542.22
      26.975     0.999998      2347055    655360.00
      26.975     0.999999      2347055    748982.86
      27.199     0.999999      2347056    873813.33
      27.199     0.999999      2347056   1048576.00
      27.199     0.999999      2347056   1165084.44
      27.215     0.999999      2347057   1310720.00
      27.215     0.999999      2347057   1497965.71
      27.215     0.999999      2347057   1747626.67
      27.215     1.000000      2347057   2097152.00
      27.215     1.000000      2347057   2330168.89
      27.711     1.000000      2347058   2621440.00
      27.711     1.000000      2347058          inf
#[Mean    =        1.420, StdDeviation   =        1.122]
#[Max     =       27.696, Total count    =      2347058]
#[Buckets =           27, SubBuckets     =         2048]
----------------------------------------------------------
  2818527 requests in 1.00m, 1.02GB read
Requests/sec:  46975.91
Transfer/sec:     17.38MB